const cities = [
    
    // 전라도
    "전주시", "군산시", "익산시", "정읍시", "남원시", "김제시", "목포시", "여수시", "순천시", "나주시", "광양시",

    // 경상도
    "포항시", "경주시", "김천시", "안동시", "구미시", "영주시", "영천시", "상주시", "문경시", "경산시", "창원시", "진주시", "통영시", "사천시", "김해시", "밀양시", "거제시", "양산시", 

    // 충청도
    "청주시", "충주시", "제천시", "천안시", "공주시", "보령시", "아산시", "서산시", "논산시", "계룡시", "당진시", "세종시",

    // 강원도
    "춘천시", "원주시", "강릉시", "동해시", "태백시", "속초시", "삼척시",

    // 경기도
    "수원시", "성남시", "고양시", "용인시", "부천시", "안산시", "안양시", "남양주시", "화성시", "평택시", "의정부시", "시흥시", "파주시", "광명시", "김포시", "광주시", "이천시", "양주시", 
    "오산시", "구리시", "안성시", "포천시", "의왕시", "하남시", "여주시",

    // 특별광역시
    "서울특별시", "부산광역시", "대구광역시", "인천광역시", "광주광역시", "대전광역시", "울산광역시",

    // 제주도
    "제주시", "서귀포시",

    // 군
    // 전라도
    "강진군", "고흥군", "곡성군", "구례군", "담양군", "무안군", "보성군", "신안군", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군",
    "고창군", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "진안군",

    // 경상도
    "거창군", "고성군(경남)", "남해군", "산청군", "의령군", "창녕군", "하동군", "함안군", "함양군", "합천군", "고령군", "군위군", "봉화군", "성주군", "영덕군", "영양군", 
    "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군",

    // 충청도
    "금산군", "부여군", "서천군", "예산군", "청양군", "태안군", "홍성군", "괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "증평군", "진천군",

    // 강원도
    "고성군(강원)", "양구군", "양양군", "영월군", "인제군", "정선군", "철원군", "평창군", "홍천군", "화천군", "횡성군",
    
    //경기도
    "가평군", "양평군", "연천군"
    
];

// const startButton = document.getElementById('travel-startButton');
// startButton.addEventListener('click', startRotating);

document.getElementById('travel-startButton').addEventListener('click', function() {
    startRotating('travel-startButton', 'cityLabel', 'travel-resultLabel', cities);
});

function showResultLabel(selected) {
    const label = document.getElementById('travel-resultLabel');
    label.textContent = [`${selected} 당첨~`];
}